
// 1
// это событие которое происходит на сайте



// 2
// Многие связанные с маусом и click



// 3
// $('.btn').click(function(){
    // 
// })



// 4
// $('.btn').click(function(){
    //  console.log("Click");
//  })


// 5
// оно будет выполняться по готовности

// 6
// он спрячет P

// 7
// он покажет P

// 8
// по двойному нажатию на блок исчезнет эллемент с айди блок

// 9
// тоже самое только когда мышка на блоке

// 10
// появится сообщение когда мышка покинет блок

// 11

// тоже самое только когда мышка нажата

// 12
// тоже самое только когда мышка отпушена

// 13
// когда мышка наведена выходит сообщение

// 14
// мы вешаем фокус на эллементы с классом блок,и выходит сообщение

// 15
// для снятия фокуса с блок

// 16
// мы вешаем фокусбзатем убераем его,и последний выведет сообщение когда мышко отпушена